window.jsLg = {
    subscribe_ok: "Спасибо. Мы добавили Ваш адрес электронной почты в список контактов.",
    subscribe_repeat : "Ваш адрес электронной почты уже есть в нашем списке, пожалуйста, попробуйте другой адрес.", 
    email_require: "Пожалуйста, введите действительный адрес электронной почты",
    repeat_pwd: "Повторите тот же самый пароль",
    require_pwd: "Пожалуйста, введите правильный пароль",
    pwd_error: "Ваш пароль является недействительным",
    pwd_success: "Ваш пароль является действительным",
    popTitle: "Сообщение",
    hi : "Здравствуйте", 
    yes: "Да",
    no: "Нет",
    ok: "ДА",
    day: "день", 
    days: "дни", 
    day_s: "ДЕНЬ(S)",
    email_only : "только по электронной почте", 
    loading : "Загрузка",
    goods_out_of_stock: "ПРОДАНО, запас меньше 0",
    add_favoraite: "Эта ссылка была добавлена в Избранное",
    del_favorite: "Вы уверены, что хотите удалить этот продукт из избранного?",
    use_coupon_msg: " Пожалуйста, введите промо-код",
    access_code_error : "Пожалуйста, введите код",  
    is_english : "Разрешены только английские символы ",  
    hotSeller : "Лучшие предложения", 
    checkItNow : "ПОСМОТРИТЕ ЭТО", 
    not_sign_in : "Зарегистрироваться | Войти", 
    cancel: "Отменить",
    apply: "Применить",
    processing: "ЗАГРУЗКА",
    emptyEmail_note: "Sorry, your Email address field is empty. Please enter Email address first.",
    sale : {
        starts : "Начать",
        ends : "конец",
        day_s: "ДН",
        days : "ДНЕЙ"
    }, // en
    giftCard : {
        title : "История Подарочных карт"
    }, // en
    deBugMsg : {
        notSetText : "Пожалуйста, добавьте комментарий !",
        argumentsIllegal : "Аргументы недопустимы",
        noCallBack : "Недопустимый номер для связи с Вами"
    },
    wholeSaleFormMsg: {
        tragetprice_require:" Пожалуйста, введите правильную расчетную цену",
        quantity_require: "Пожалуйста, введите действительную сумму",
        country_require: "Пожалуйста, введите правильный страну",
        username_require: "Пожалуйста, введите имя пользователя",
        userphone_require: "Пожалуйста, введите действительный номер телефона",
        email_require: " Пожалуйста, введите действительный адрес электронной почты",
        info_require: " Пожалуйста, объясните подробно ваш запрос о предоставлении информации"
    },
    loginFormMsg: {
        login_email_require:"Пожалуйста, введите действительный адрес электронной почты",
        login_pwd_require: "Пожалуйста, введите правильный пароль",
        login_pwd_error: "Ваш пароль является недействительным"
    },
    signFormMsg: {
        sign_email_require: "Пожалуйста, введите действительный адрес электронной почты",
        sign_email_remote: "Этот адрес электронной почты уже используется",
        sign_pwd_require: "Пожалуйста, введите правильный пароль",
        sign_pwd_maxlength: "Вы можете ввести максимум {0} символов",
        sign_pwd_minlength: "Введите по крайней мере {0} символов",
        sign_pwd_repeat: "Повторите тот же самый пароль",
        sign_agreement: "Пожалуйста, примите Правила и условия Rosegal.com ",
        not_newUser: 'Только буквы, цифры и ". ", "-", "_", "@" использованы.',
        not_newPwd: "Длина пароля должна быть не менее 8 символов,он должен включать буквы и цифры."
    },
    findPwdFormMsg: {
        email_require: "Пожалуйста, введите действительный адрес электронной почты",
        verifycode_require: " Введите код подтверждения"
    },
    setPwdFormMsg: {
        email_require: "Пожалуйста, введите действительный адрес электронной почты",
        pwd_require: "Пожалуйста, введите правильный пароль",
        pwd_minlength: "Введите по крайней мере {0} символов",
        pwd_maxlength: "Вы можете ввести максимум {0} символов",
        repwd_require: "Повторите тот же самый пароль",
        repwd_minlength: "Введите по крайней мере {0} символов",
        repwd_maxlength: "Вы можете ввести максимум {0} символов",
        repwd_repeat: "Повторите тот же самый пароль",
        repwd_not_newPwd: "Длина пароля должна быть не менее 8 символов,он должен включать буквы и цифры."
    },
    reviewFormMsg: {
        review_stars_require: "Пожалуйста, введите правильный счет",
        review_name_require: "Пожалуйста, введите правильное имя",
        review_name_maxlength: "Пожалуйста, не превышайте {0} символов .",  
        review_title_require: "Добавьте название на Ваш комментарий",
        review_title_minlength: "Введите по крайней мере {0}  символов ", 
        review_title_maxlength: "Пожалуйста, не превышайте {0} символов.", 
        review_content_require: "Пожалуйста, введите содержание",
        review_content_minlength: "Введите по крайней мере {0}  символов ", 
        review_content_exceed: "Ваше содержание не должно превышать {0} символов.",
        review_videourl_require: "Введите действительное URL видео" 
    },
    questionFormMsg: {
        question_topic: "Выберите тип вопроса",
        question_name: "Вставьте тему",
        question_content: "Введите Ваше сообщение"
    },
    surveyFormMsg: {
        rate_item_require: "Мы рекомендуем !"
    },
    addressFormMsg: {
        firstname_require: "Пожалуйста, введите ваше имя",
        firstname_minlength: "Вы можете написать минимум {0} символов", 
        firstname_maxlength: "Вы можете ввести максимум {0} символов",
        lastname_require: "Пожалуйста, введите ваше имя",
        lastname_minlength: "Вы можете написать минимум {0} символов", 
        lastname_maxlength: "Вы можете ввести максимум {0} символов",
        tel_require: "Пожалуйста, введите действительный номер телефона",
        tel_maxlength: "Вы можете ввести максимум {0} символов",
        email_require: "Пожалуйста, введите действительный адрес электронной почты ",
        email_maxlength: "Вы можете ввести максимум 60 символов",
        email_vaild : "Пожалуйста, введите действительный адрес электронной почты", 
        addressline1_require: "Пожалуйста, введите полный адрес в строке 1",
        addressline1_maxlength: "Для длинных адресов {0} символов или перейдите в строку 2",
        addressline2_maxlength: "Вы можете ввести максимум {0} символов",
        city_require: "Пожалуйста, введите город назначения",
        city_maxlength: "Вы можете ввести максимум {0} символов",
        province_require: "Пожалуйста, введите регион / область / край ",
        country_require: "Пожалуйста, введите страну получателя",
        zipcode_require: "Пожалуйста, введите почтовый индекс",
        zipcode_maxlength: "Вы можете ввести максимум {0} символов",
        not_select_address: "Пожалуйста, выберите адрес.",
        del_address: "Вы уверены, что хотите удалить этот адрес ?",
        not_all_num: "Вводите действительное название города"
    },
    profileFormMsg: {
        firstname_require: "Пожалуйста, введите ваше имя",
        firstname_maxlength: "Вы можете ввести максимум {0} символов",
        lastname_require: "Пожалуйста, введите ваше имя",
        lastname_maxlength: "Вы можете ввести максимум {0} символовs",
        birthday_day_require: "Выберите день ",
        birthday_month_require: "Выберите месяц",
        birthday_year_require: "Пожалуйста, выберите год" 
    },
    passwordFormMsg: {
        original_pwd_require: "Пожалуйста, введите правильный пароль",
        original_pwd_error: "Ваш пароль является недействительным",
        new_pwd_require: "Пожалуйста, введите новый пароль",
        new_pwd_minlength: "Введите по крайней мере {0} символов",
        new_pwd_maxlength: "Вы можете ввести максимум {0} символов",
        renew_pwd_require: "Пожалуйста, введите правильный пароль",
        renew_pwd_minlength: "Введите по крайней мере {0} символов",
        renew_pwd_maxlength: "Вы можете ввести максимум {0} символов",
        renew_pwd_repeat: "Повторите тот же самый пароль",
        renew_not_newPwd: "Длина пароля должна быть не менее 8 символов,он должен включать буквы и цифры."
    },
    walletMsg: {
        not_numAndLetter: "Ваш пароль должен содержать буквы и цифры."
    },
    cartMsg:{
        not_select_goods:"Вы должны выбрать детали прежде чем заказать .",
        batch_clear_tip:"Пожалуйста, выберите изделия.",
        batch_save_tip:"Пожалуйста, выберите изделия.",
        couponTips : "<p>(1)Пожалуйста, используйте купон во время срока акции. </ P> <p> (2) Купон применим только на покупку товара .</p><p>(3) Купон может быть использован только на покупку товаров, скидка на стоимость доставки или страхование не распространяется.</p>",
        promotionTips : "<p>Обращаем ваше внимание, что купон не может быть использован с другими специальными предложениями или акциями продажи:.</p>"
    },
    checkoutMsg: {
        not_select_shipping:"Выберите способ доставки.",
        not_select_paymethod:"Выберите способ оплаты.",
        wallet_pwd_empty: "Введите свой пароль.",
        wallet_pwd_error: "Ваш пароль неверный, пожалуйста, попробуйте еще раз.",
        not_select_payment: "Баланс вашего кошелька недостаточен, пожалуйста, используйте другой способ оплаты, чтобы оплатить оставшуюся сумму.",
        not_select_giftcard: "Пожалуйста, выберите подарочную карту.",
        not_post_words: "Пожалуйста, введите ваши инструкции.",
        post_words_over: " Ваш комментарий должен быть меньше {0} символов.",
        tax_tips: {
            argentina: '<p class="black_font">Ваш заказ будет отправлен в Аргентину. <br/>Если вы выбираете ускоренную перевозку груза, пожалуйста, введите свой <B> Налоговый ID </ b>, для обеспечения оформления  и доставки.</p>',
            chile: '<p class="black_font">Ваш заказ будет отправлен в Чили. <br/>Если вы выбираете ускоренную перевозку груза, пожалуйста, введите свой <B> Налоговый ID </ b>, для обеспечения оформления  и доставки.</p>',
            india: '<p class="black_font">Ваш заказ будет отправлен в Индия. <br/>Если вы выбираете ускоренную перевозку груза, пожалуйста, введите свой <B> Налоговый ID </ b>, для обеспечения оформления  и доставки.</p>',
			Brazil: '<p class="black_font">Ваш заказ будет отправлен в Бразилия. <br/>Если вы выбираете ускоренную перевозку груза, пожалуйста, введите свой <B> Налоговый ID </ b>, для обеспечения оформления  и доставки.</p>',
            Russian: '<p class="black_font">По новому приказе из ФТС с 7 декабря таможню пройдут только посылки, по которым предоставлены ИНН получателя и интернет-ссылки на каждый товар в заказе,пожалуйста, заполните для обеспечения таможенной контроли и доставки. Одновременно, у каждых русских пошлины за посылки стоимостью до 1000 евро и весом до 31 кг в течение месяца.</p>'
        },
        wire_transfer_tip:'<p>Большое спасибо за покупки на Rosegal. Пожалуйста, <a class="red_font" href="https://support.rosegal.com/ticket/ticket/index?lang=en" target="_blank">давайте  информациию</a>, наш клиент обслуживания  помогает вам совершить платеж.</p>'
    },
    phoneMsg:{
        phone_require : " Пожалуйста, введите свой номер телефона",
        phone_no_number : "Пожалуйста, введите свой номер телефона",
        phone_illegal : "Используйте только цифры: +, -, или ()",
        phone_less_than : "Введите по крайней мере {0} символов",
        phone_more_than : "Вы можете ввести максимум {0} символов"
    },
    uploadMsg:{
        uploadFailed : "Ошибка, фотографии не были импортированы, пожалуйста, повторите попытку",
        uploadIllegal : "Пожалуйста, импортируйте фотографии в формате JPEG. Максимальный размер 2MB",
        uploadNothing : "Вы не выбрали файл для импорта "
    },
    buyerShowMsg:{
        errorMsg : "Была обнаружена ошибка.",
        notChooseItem : "Выберите раздел, которая представит Ваш первый стиль！"
    },
    loginFbMailMsg:{
        email_require_msg:'Please enter a valid email address',
        email_maxlength:'You can write a maximum of {0} characters',
        email_in_user: 'The email address is already in use.'
    },
    top:"ТОП"
};
